function [prob, p] = predictOneVsAll(all_theta, X)
%  p = PREDICTONEVSALL(all_theta, X) поверне вектор прогнозів для кожного
%прикладу в матриці X. Зверніть увагу, що X містить приклади в рядках.
%all_theta — це матриця, де i-й рядок — тета-вектор навченої логістичної
%регресії для i-го класу. Ви повинні встановити для p вектор значень
%від 1..K (наприклад, p = [1; 3; 1; 2] передбачає класи 1, 3, 1, 2
%для 4 прикладів)
m = size(X, 1);
num_labels = size(all_theta, 1);

% Вам потрібно правильно повернути наступні змінні
p = zeros(size(X, 1), 1);


X = [ones(m, 1) X];

% ====================== Ваш код ======================
% Інструкції: Доповніть наведений нижче код, щоб зробити прогнози,
% використовуючи вивчені параметри логістичної регресії (OneVsAll).
% Ви повинні встановити p як вектор прогнозів (від 1 до num_labels).
%
% Підказка: весь цей код можна векторизувати за допомогою функції max.
% Зокрема, функція max також може повертати індекс максимального елемента,
% Якщо ваші приклади містяться в рядках, ви можете використовувати
% max(A, [], 2), щоб отримати максимальне значення для кожного рядка.
%







% =========================================================================


end
