clear % очищає workspace
close all % закриває всі figures
clc % очищує командний рядок
; % зупиняє виведення результатів у командному рядку
close all; clc;


%% ==================== Елементарні операції ====================
5+6
3-2
5*8
1/2
2^6 % піднесення до степеня
1 == 2 % false - перевірка на рівність
1 ~= 2 % true - перевірка на нерівність
1 && 0 % логічне "І"
1 || 0 % логічне "АБО"
xor(1,0) % виключне "АБО" (Виключна диз'юнкція)


%% ==================== Присвоєння змінних ====================
a = 3; % ";" зупиняє виведення результатів у командному рядку
b = 'hi';
c = 3>=1;

%% ==================== Виведення змінних ====================
a = pi
disp(a)
disp(sprintf('2 decimals: %0.2f', a))
disp(sprintf('6 decimals: %0.6f', a))
format long
a
format short
a


%% ==================== Вектори і матриці ====================
A = [1 2; 3 4; 5 6]

v = [1 2 3]
v = [1; 2; 3]
v = 1:0.1:2   % від 1 до 2, з кроком 0,1
v = 1:6       % від 1 до 6, передбачається розмір кроку 1 (вектор-рядок)

C = 2*ones(2,3) % C = [2 2 2; 2 2 2]
w = ones(1,3)   % 1x3 одиничний вектор
w = zeros(1,3)
w = rand(1,3) % рівномірний розподіл
w = randn(1,3) % нормальний розподіл (mean=0, var=1)
w = -6 + sqrt(10)*(randn(1,10000));  % (mean = -6, var = 10)
hist(w)    % побудова гістограми з 10-ти стовпчиків (10 - за замовчуванням)
hist(w,50) % побудова гістограми з 50-ти стовпчиків


E = eye(4)   % 4x4 оголошення одиничної матриці

%% ==================== Функція help ====================
help eye
help rand
help help


