function [J, grad] = costFunction(theta, X, y)
%COSTFUNCTION Обчислює функцію якості та градієнти функції якості для логістичної регресії
%   J = COSTFUNCTION(theta, X, y) обчислює функцію якості застосування theta
%   як параметрів логістичної регресії та градієнта функції якості
%   відносно кожного параметра theta.

% Ініціалізація додаткових змінних
m = length(y); % кількість навчальних прикладів

% Вам потрібно правильно повернути наступні змінні
J = 0;
grad = zeros(size(theta));

% ====================== Ваш код ======================
% Інструкції:
% Обчисліть функцію якості при конкретних theta
% Ви повинні змінній J присвоїти значення функції якості
% Обчисліть частинні похідні функції якості
% та змінній grad присвойте частинні похідні відносно кожного параметра theta

%
% Примітка: grad повинен бути тієї самої розмірності, що й theta
%



% =============================================================

end
