function plotData(X, y)
%PLOTDATA Будує діаграму розсіювання X і y в новій фігурі
%   PLOTDATA(x,y) наносить на графік точки даних, де + відповідають позитивним прикладам
% і o відповідають негативним прикладам.

% Створення нового вікна для відображення
figure; hold on;

% ====================== Ваш код ======================

% Знаходження індексів позитивних і негативних прикладів
pos = find(y==1); neg = find(y == 0);
% Побудова діаграми розсіювання
plot(X(pos, 1), X(pos, 2), 'k+','LineWidth', 2, 'MarkerSize', 7);
plot(X(neg, 1), X(neg, 2), 'ko', 'MarkerFaceColor', 'y', 'MarkerSize', 7);



% =========================================================================



hold off;

end
