function plotDecisionBoundary(theta, X, y)
%PLOTDECISIONBOUNDARY Будує діаграму розсіювання X і y в новій фігурі
% з граничною лінією рішення, визначеною theta
%   PLOTDECISIONBOUNDARY(theta, X,y) наносить на графік точки даних, де + відповідають позитивним прикладам
% і o відповідають негативним прикладам.


% Побудова графіка
plotData(X(:,2:3), y);
hold on

    % Для визначення лінії потрібні лише 2 точки, тому вибираються дві кінцеві точки
    plot_x = [min(X(:,2))-2,  max(X(:,2))+2];

    % Обчислення граничної лінії рішення
    plot_y = (-1./theta(3)).*(theta(2).*plot_x + theta(1));

    % Побудова графіка та налаштування осей для кращого перегляду
    plot(plot_x, plot_y)

    % Легенда
    legend('Зараховано', 'Не зараховано', 'Гранична лінія рішення')
    axis([30, 100, 30, 100])

hold off

end
