function p = predict(theta, X)
%PREDICT Повертає прогнозоване значення мітки 0 чи 1 (зараховано/не зараховано), використовуючи отримані параметри логістичної регресії theta
%   p = PREDICT(theta, X) обчислює прогноз для X, використовуючи порогове значення 0,5
%   (якщо sigmoid(theta'*x) >= 0.5, прогнозоване значення - 1)

m = size(X, 1); % кількість навчальних прикладів

% Вам потрібно правильно повернути наступні змінні
p = zeros(m, 1);

% ====================== Ваш код ======================
% Інструкції:
% Доповніть код, щоб робити прогнози, використовуючи вивчені
% параметри логістичної регресії.
% Ви повинні присвоїти змінній p вектор 0-лів або 1-ць

p=ifelse(sigmoid(X*theta) >= 0.5, 1, 0);





% =========================================================================


end
