function J = computeCost(X, y, theta)
%COMPUTECOST обчислює функцію якості для лінійної регресії
%   J = COMPUTECOST(X, y, theta)обчислює функцію якості при використанні theta
%   як параметрів лінійної регресії для забезпечення відповідності точок X та y

% Ініціалізація додаткових змінних
m = length(y); % кількість навчальних прикладів

% Вам потрібно правильно повернути наступні змінні

J = 0;

% ====================== Ваш код ======================
% Інструкції:
% Обчисліть значення функції якості
% при конкретних значеннях параметрів theta.
% Обраховану функцію якості потрібно присвоїти змінній J





% =========================================================================

end
