function plotData(x, y)
% PLOTDATA(x,y) Будує діаграму розсіювання для оцінки зв'язку x та y
% в окремому вікні графічного відображення даних – figure;
% встановлює назви осей: населення та прибуток відповідно


figure; % відкрити нове вікно для побудови діаграми

% ====================== Ваш код ======================
% Інструкції:
% - Побудуйте діаграму розсіювання у новому вікні
%   за допомогою команд "figure" та "plot".
% - Встановіть назви осей за допомогою команд "xlabel" та "ylabel".

% Дані про населення та прибутки передаються як аргументи x та y цієї функції.

% Для того щоб точки відображалися у вигляді червоних маркерів "x" можете
% використовувати атрибут функції plot 'rx' та змінювати їх розмір атрибутом
% 'MarkerSize'


% ============================================================

end
